world_name = '《哈利波特》'
# + 给出《哈利波特》中，角色哈利波特喜欢的，或者喜欢角色哈利波特的20个人物，用一个Python字符串列表的形式给出，如['赫敏', ... ]
# 《哈利波特》世界中，露娜·洛夫古德最终的结局是什么？
# 怎么认识
# 一开始的设定是什么
like_persons = ['赫敏', '罗恩·韦斯莱', '金妮·韦斯莱', '丽莎·塔比', '光明神德里克·马尔尼', '丽塔·斯基特', '汤姆·里德尔', '希拉利·哈夫尔巴特', '杰姆·韦斯莱', '大卫·威廉姆斯', '不死鸟阿不思·邓布利多', '西弗勒斯·斯内普', '谷雨.香克林', '露娜·洛夫古德', '第二年级学生阿兹卡班囚犯', '凤凰卫士', '德波拉·梅勒', '林妮·李', '克里维', '奈威里・皮易明']

# + 给出《哈利波特》中，角色哈利波特讨厌的，或者讨厌角色哈利波特的20个人物，用一个Python字符串列表的形式给出，如['伏地魔', ... ]
hate_persons = ['齐默尔曼教授', '莉莉·波特的姨妈', '达力·达思礼', '弗农·达思礼', '佩妮花·清水', '闫妮·乌木', '奇洛·霍恩比', '贝拉特里克斯·莱斯特兰奇', '卢夫金', '卢修斯·马尔福', '纳吉尼', '彼得·佩迪鲁', '琼·韦斯莱', '霍拉丁教授', '奎德奎奎斯·克里科斯', '李·乔丹', '格雷特·琼斯', '维基托·克鲁姆', '夫人·芙莉达·卢胡夫']

# 给出《哈利波特》的世界中，角色们经常出现的情绪或状态，用一个Python字符串列表的形式给出，如['喜悦'， 
emotion_list = ['喜悦', '愤怒', '伤心', '恐惧', '惊喜', '惊恐', '满足', '焦虑', '紧张', '欣喜', '沮丧', '快乐', '不安', '压抑', '疑惑', '困惑', '羞愧', '愉悦', '嫉妒', '挫败', '孤独', '痛苦', '恼火', '慌张', '害怕']
emotions = ['喜悦', '愤怒', '伤心', '恐惧', '惊喜', '惊恐', '满足', '焦虑', '紧张', '欣喜', '沮丧', '快乐', '不安', '压抑', '疑惑', '困惑', '羞愧', '愉悦', '嫉妒', '挫败', '孤独', '痛苦', '恼火', '慌张', '害怕']